linux/linuxos/Hadoop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2014-12-21 Sun 05:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 源码安装hadoop-2.6.0</a>
<ul>
<li><a href="#sec-1-1">1.1. 依赖</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. maven</a></li>
<li><a href="#sec-1-1-2">1.1.2. findbugs</a></li>
<li><a href="#sec-1-1-3">1.1.3. protoc</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 安装</a></li>
<li><a href="#sec-1-3">1.3. 解决Unable to load native-hadoop library</a></li>
<li><a href="#sec-1-4">1.4. 配置</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. core-site.xml</a></li>
<li><a href="#sec-1-4-2">1.4.2. mapred-site.xml</a></li>
<li><a href="#sec-1-4-3">1.4.3. hdfs-site.xml</a></li>
<li><a href="#sec-1-4-4">1.4.4. yarn-site.xml</a></li>
<li><a href="#sec-1-4-5">1.4.5. slaves</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. HBase安装</a>
<ul>
<li><a href="#sec-2-1">2.1. 配置</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. hbase-site.xml</a></li>
<li><a href="#sec-2-1-2">2.1.2. hbase-env.sh</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 注意：版本兼容问题</a></li>
</ul>
</li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 源码安装hadoop-2.6.0</h2>
<div class="outline-text-2" id="text-1">
<p>
centos下源码编译安装<br/>
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 依赖</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
yum install lzo-devel  zlib-devel  gcc autoconf automake libtool   ncurses-devel openssl-devel
</pre>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> maven</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
wget http://mirror.nus.edu.sg/apache/maven/maven-3/3.2.5/binaries/apache-maven-3.2.5-bin.tar.gz
tar zxvf apache-maven-3.2.5-bin.tar.gz -C /usr/local
vi /etc/profile
添加
export M2_HOME=/usr/local/apache-maven-3.2.5
export M2=$M2_HOME/bin
export PATH=$PATH:$M2
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> findbugs</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
wget http://prdownloads.sourceforge.net/findbugs/findbugs-3.0.0.tar.gz?download
tar zxf findbugs-3.0.0.tar.gz -C /usr/local
ls /usr/local/findbugs-3.0.0/
vi /etc/profile
添加
export FINDBUGS_HOME=/usr/local/findbugs-3.0.0
export PATH=$PATH:$FINDBUGS_HOME/bin
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> protoc</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
tar jxvf protobuf-2.5.0.tar.bz2 
cd protobuf-2.5.0
./configure --prefix=/usr
make
make install
protoc --version
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 安装</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
mvn package -Pdist,native,docs -DskipTests -Dtar
</pre>
<p>
hadoop-dist/target/hadoop-2.6.0为编译后可用的hadoop.<br/>
hadoop-dist/target/hadoop-2.6.0/hadoop-dist/target/hadoop-2.6.0/api为文档<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 解决Unable to load native-hadoop library</h3>
<div class="outline-text-3" id="text-1-3">
<p>
在hadoop-env.sh中修改<br/>
</p>
<pre class="example">
export HADOOP_OPTS="$HADOOP_OPTS -Djava.net.preferIPv4Stack=true"
</pre>
<p>
为<br/>
</p>
<pre class="example">
export HADOOP_OPTS="$HADOOP_OPTS -Djava.net.preferIPv4Stack=true -Djava.library.path=/usr/hadoop/hadoop-2.6.0/lib/native"
</pre>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 配置</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> core-site.xml</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span>?&gt;
&lt;?<span style="color: #a020f0;">xml-stylesheet</span> <span style="color: #8b2252;">type="text/xsl" href="configuration.xsl"</span>?&gt;
&lt;<span style="color: #0000ff;">configuration</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;
    &lt;<span style="color: #0000ff;">name</span>&gt;fs.defaultFS&lt;/<span style="color: #0000ff;">name</span>&gt;
    &lt;<span style="color: #0000ff;">value</span>&gt;hdfs://master:9000&lt;/<span style="color: #0000ff;">value</span>&gt;
  &lt;/<span style="color: #0000ff;">property</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;
    &lt;<span style="color: #0000ff;">name</span>&gt;hadoop.tmp.dir&lt;/<span style="color: #0000ff;">name</span>&gt;
    &lt;<span style="color: #0000ff;">value</span>&gt;/usr/hadoop-2.6.0-root-data&lt;/<span style="color: #0000ff;">value</span>&gt;
  &lt;/<span style="color: #0000ff;">property</span>&gt;
&lt;/<span style="color: #0000ff;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> mapred-site.xml</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span>?&gt;
&lt;?<span style="color: #a020f0;">xml-stylesheet</span> <span style="color: #8b2252;">type="text/xsl" href="configuration.xsl"</span>?&gt;
&lt;<span style="color: #0000ff;">configuration</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;
    &lt;<span style="color: #0000ff;">name</span>&gt;mapreduce.framework.name&lt;/<span style="color: #0000ff;">name</span>&gt;
    &lt;<span style="color: #0000ff;">value</span>&gt;yarn&lt;/<span style="color: #0000ff;">value</span>&gt;
  &lt;/<span style="color: #0000ff;">property</span>&gt;
&lt;/<span style="color: #0000ff;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> hdfs-site.xml</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span>?&gt;
&lt;?<span style="color: #a020f0;">xml-stylesheet</span> <span style="color: #8b2252;">type="text/xsl" href="configuration.xsl"</span>?&gt;
&lt;<span style="color: #0000ff;">configuration</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;
    &lt;<span style="color: #0000ff;">name</span>&gt;dfs.namenode.secondary.http-address&lt;/<span style="color: #0000ff;">name</span>&gt;
    &lt;<span style="color: #0000ff;">value</span>&gt;master:9001&lt;/<span style="color: #0000ff;">value</span>&gt;
  &lt;/<span style="color: #0000ff;">property</span>&gt;
&lt;/<span style="color: #0000ff;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> yarn-site.xml</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span>?&gt;
&lt;?<span style="color: #a020f0;">xml-stylesheet</span> <span style="color: #8b2252;">type="text/xsl" href="configuration.xsl"</span>?&gt;
&lt;<span style="color: #0000ff;">configuration</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;
    &lt;<span style="color: #0000ff;">name</span>&gt;yarn.resourcemanager.hostname&lt;/<span style="color: #0000ff;">name</span>&gt;
    &lt;<span style="color: #0000ff;">value</span>&gt;master&lt;/<span style="color: #0000ff;">value</span>&gt;
  &lt;/<span style="color: #0000ff;">property</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;  
    &lt;<span style="color: #0000ff;">name</span>&gt;yarn.nodemanager.aux-services&lt;/<span style="color: #0000ff;">name</span>&gt;  
    &lt;<span style="color: #0000ff;">value</span>&gt;mapreduce_shuffle&lt;/<span style="color: #0000ff;">value</span>&gt;  
  &lt;/<span style="color: #0000ff;">property</span>&gt;  
&lt;/<span style="color: #0000ff;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> slaves</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">

<pre class="src src-xml">slave1
slave2
slave3
slave4
slave5
slave6
slave7
slave8
slave9
slave10
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> HBase安装</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 配置</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> hbase-site.xml</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #0000ff;">configuration</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;  
    &lt;<span style="color: #0000ff;">name</span>&gt;hbase.rootdir&lt;/<span style="color: #0000ff;">name</span>&gt;  
    &lt;<span style="color: #0000ff;">value</span>&gt;hdfs://master:9000/hbase&lt;/<span style="color: #0000ff;">value</span>&gt;  
  &lt;/<span style="color: #0000ff;">property</span>&gt;  
  &lt;<span style="color: #0000ff;">property</span>&gt;  
    &lt;<span style="color: #0000ff;">name</span>&gt;hbase.cluster.distributed&lt;/<span style="color: #0000ff;">name</span>&gt;  
    &lt;<span style="color: #0000ff;">value</span>&gt;true&lt;/<span style="color: #0000ff;">value</span>&gt;  
  &lt;/<span style="color: #0000ff;">property</span>&gt;
  &lt;<span style="color: #0000ff;">property</span>&gt;  
    &lt;<span style="color: #0000ff;">name</span>&gt;hbase.zookeeper.quorum&lt;/<span style="color: #0000ff;">name</span>&gt;  
    &lt;<span style="color: #0000ff;">value</span>&gt;master,slave1,slave2,slave3,slave4,slave5,slave6,slave7,slave8,slave9,slave10&lt;/<span style="color: #0000ff;">value</span>&gt;  
  &lt;/<span style="color: #0000ff;">property</span>&gt;
</pre>
</div>
<p>
&lt;/configuration&gt;<br/>
</p>
<p>
#+END_SRC<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> hbase-env.sh</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
修改JAVA_HOME和HBASE_MANAGES_ZK（使用hbase自带的zookeeper则设为true）<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 注意：版本兼容问题</h3>
</div>
</div>
</div>
</body>
</html>
